import {Substance} from "./types";

export const requestTime = 1000


export const iSubstancesMock:Substance[] = [
    {
        id: 1,
        name: "4-терт-бутил циклогексанол",
        description: "Он является инновационным синтетическим соединением с выраженной противовоспалительной активностью. Ощущения зуда и дискомфорта на коже ассоциировано с активностью терморецептора TRPV1, именно этот рецептор активируется капсаицином – активным веществом красного перца. Не так давно был открыт селективный ингибитор рецептора TRPV1 – 4-терт-бутилциклогексанол, он избирательно отключает этот рецептор и таким образом блокирует проявления воспалительной реакции. За счет этого снимает зуд, раздражение и покраснение. Растворим в маслах, эмолентах, пропиленгликоле. Нерастворим в воде. Можно вводить в масляную фазу до эмульгирования, или в готовую эмульсию.",
        status: 1,
        image: "",
    },
    {
        id: 2,
        name: "Massocare",
        description: "Жидкий неионногенный ПАВ для гидрофильных масел, со-эмульгатор для эмульсий вода-в-масле.Разработан для гидрофильных масел для тела и душа, мягких очищающих средств, скрабов, массажных средств и др. на масляной основе. Обеспечивает легкое смывание средства с кожи. При нанесени на влажные руки или при смешении с водой образуется эмульсия, которая удаляет загрязения без эффекта липкости и жирности на коже. Процент ввода: от 5 до 10%. Совместим с синтетическими и с натуральными маслами.",
        status: 1,
        image: "",
    },
    {
        id: 3,
        name: "Protein HPTW",
        description: "Гидролизованные протеины пшеницы обладают сродством к кератину из которого состоит волос. За счет этого они обладают кондиционирующим эффектом, восполняют повреждения в структуре волоса и укрепляют его. Снижают раздражающее действие детергентов на кожу скальпа в шампунях. Химическая модификация четвертичными аммониевым соединением (гидроксипропилтримониум) придает протеинам лучшие кондиционирующие свойства и увеличивает их сродство к кератину волос. Таким образом, модифицированные протеины обладают всеми полезными свойствами гидролизованных протеинов, но в усиленной форме. Растворимы в воде. Нерастворимы в маслах и эмолентах. Устойчивы к нагреванию. Можно вводить в водную фазу, или в готовый продукт. Область применения: шампуни, бальзамы-ополаскиватели, маски для волос, сыворотки для волос",
        status: 1,
        image: "",
    },
]